app/Controllers/Auth.php

SELECT *
FROM `admin`
WHERE `email` = 'kppn.pkl@gmail.com'
 LIMIT 1
---
    public function doLogin()
    {
        $session = session();
        $model = new \App\Models\AdminModel();

        $email = trim($this->request->getPost('email'));
        $password = trim($this->request->getPost('password'));

        $admin = $model->where('email', $email)->first();